Ran Plan for project: `environments` dir: `environments/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
time=2023-01-10T07:03:23Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/Jeevaann/atlantis-terragrunt-profiles/4/default/modules. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/vault...
- Finding hashicorp/aws versions matching "~> 4.45.0"...
- Installing hashicorp/vault v3.12.0...
- Installed hashicorp/vault v3.12.0 (signed by HashiCorp)
- Installing hashicorp/aws v4.45.0...
- Installed hashicorp/aws v4.45.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.vault_aws_access_credentials.creds: Reading...
data.vault_aws_access_credentials.creds: Still reading... [10s elapsed]
data.vault_aws_access_credentials.creds: Still reading... [20s elapsed]
data.vault_aws_access_credentials.creds: Read complete after 23s [id=aws-tg/creds/aws-atlantis/BSEZ3IPtTfwd9KaYfKekD3Qo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Testing-nat-eip"
        }
      + tags_all             = {
          + "Name" = "Testing-nat-eip"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Testing-igw"
        }
      + tags_all = {
          + "Name" = "Testing-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Testing-nat-gw"
        }
      + tags_all             = {
          + "Name" = "Testing-nat-gw"
        }
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_igw will be created
  + resource "aws_route" "public_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_route will be created
  + resource "aws_route_table" "private_route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Testing-private-rt"
        }
      + tags_all         = {
          + "Name" = "Testing-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_route will be created
  + resource "aws_route_table" "public_route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Testing-public-rt"
        }
      + tags_all         = {
          + "Name" = "Testing-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_assoc[0] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_assoc[1] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[0] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[1] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.default_group will be created
  + resource "aws_security_group" "default_group" {
      + arn                    = (known after apply)
      + description            = "Default Secuirty Group for EKS VPC Network"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Testing-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Testing-default-sg"
        }
      + tags_all               = {
          + "Name" = "Testing-default-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.default_egress_rule will be created
  + resource "aws_security_group_rule" "default_egress_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ing_http_rules will be created
  + resource "aws_security_group_rule" "ing_http_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ing_ssh_rules will be created
  + resource "aws_security_group_rule" "ing_ssh_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_subnet.eks_private_subnets[0] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Testing-private-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Testing-private-subnet-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_private_subnets[1] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Testing-private-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Testing-private-subnet-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_public_subnets[0] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Testing-public-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Testing-public-subnet-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_public_subnets[1] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Testing-public-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Testing-public-subnet-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
  + resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "Testing-vpc"
        }
      + tags_all                             = {
          + "Name" = "Testing-vpc"
        }
    }

  # vault_generic_secret.example will be created
  + resource "vault_generic_secret" "example" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/foo"
    }

Plan: 21 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

time=2023-01-10T07:05:58Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/Jeevaann/atlantis-terragrunt-profiles/4/default/modules. Relative paths in downloaded Terraform code may not work.
No state.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p environments`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=Jeevaann%252Fatlantis-terragrunt-profiles%252Fenvironments%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p environments`
</details>
Plan: 21 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
